a = int(input())
b = int(input())
if b != 0:
    print(f"Сумма: {a} + {b} = {a + b}")
    print(f"Разность: {a} - {b} = {a - b}")
    print(f"Произведение: {a} * {b} = {a * b}")
    print(f"Деление: {a} / {b} = {a / b}")
    print(f"Сумма: {a} + {b} = {a + b}")
    print(f"Целочисленное деление: {a} // {b} = {a // b}")
    print(f"Остаток от деления: {a} % {b} = {a % b}")
    print(f"Возведение в степень: {a} ** {b} = {a ** b}")
else:
    print("Невозможно установить для второй переменной значение 0.")